# # Тема: Модулі, пакети, фреймворки, бібліотеки, регулярні вирази

# # МОДУЛІ - будь-який файл з розширенням .py
# # має свій власний скоуп
# # ми можемо імпортувати - діставати собі щось з інших модулів, за допомогою ключового слова import

# # Меджік неймінги - їх придумав сам Россум - вони мають специфічну назву за якою ховається певний функціонал і їх можна перегружати (буде детальніше в темі 10 - ООП)
# # Один з таких - це __name__ - це змінна, яку можна викликати в будь-якому файлі - і вона буде повертати нам ім'я даного файлу.
# print(__name__) # - поверне __main__ (не lesson08) - бо він переназивє той файл, який ми конкретно ранимо - з якого починається програма запускатись - якщо в інших так написати і вони запустяться після поточного - то буде нормальне ім'я файлу і дерикторії (через крапочку) де знаходиться

# # Package - будь-яка дерикторія, яка містить в собі модуль, або сабдерикторію з модулем
# # !Важливо (в другому пайтоні, щоб дерикторія була пекеджом була вимога - наявність в ньому файлику __init__.py # В третьому це забрали
# # __init__.py - конструктор пекеджу - тобто якщо щось буде імпортуватися, то в пекеджі виконається ініт і дальше піде створення файлів, модулів - це відповідно який там конструктор. 
# __init__.py - не об'ов'язковий можуль в пекеджі, але у випадку, якщо він існує - він буде виконуватись самий перший (часто так роблять щоб надати те, що є паблік - наприклад є бібліотека і щоб не ходити по директоріям і не імпортувати що там є - виносять імпорти в ініт і вони одразу стають доступними розробнику в його програмі)
# # Якщо нам ініт перегружати не треба, то ми можемо і не створювати такий файл)). 
# # Package без модуля не буде зберігатись в гіт(він побачить зміни, що є пекедж, тільки після створення в ньому модуля)

# # Бібліотека - набір пекеджів і модулів (програмка - набір функцій, надлаштування для програми - часто взята з зовнішнього світу)

# # Фреймворк - це бібліотека, але не просто зі статичним набором функцій, а у фреймворку можна розширюватись - пронаслідуватись і отримати певний функціонал

# # Бібліотека - це коробочка (вона є і тільки нею можна користуватись), 
# # а фреймворк - це коробочка, в яку можна щось додати, причипити щось збоку

# # Усі ці речі існують для розробників, щоб структурувати код (туди ж класи)
# # (!!! ПОЧЧИТАТИ ДОДАТКОВО) Є конвеншени і прийняті структури - робити папки src і таке інше
# # Що таке конфігурити? - типу якщо якоть робити - то не треба конфігурити, а якщо по своєму писати то треба наконфігурити де які темплейти і таке інше

# # МОДУЛІ
# Як створити модуль - створити файл з- розширенням py
# Коли відбувається виклик модуля - те, що він виконується? - це або коли ми запускаємо цей модуль, або коли відбувається імпорт модуля, або чогось з цього модуля
# # ми можемо імпортувати - діставати собі щось з інших модулів, за допомогою ключового слова import
# # імпортуємо завжди згори перед початком остновного коду
# # якщо перейти на math через command - побачимо що відкриється модуть math - файл з розширенням pyi - в якому перелічені усі функції, які він має, але без реалізації (реалізація на С і прихована)
# # так само з buildin функціями - якщо так само перейти на print - ця функція знаходиться у файлі buildin - тому так і називаються buildin функції - ми їх не імпортуємо,. вони відразу загружаться автоматично
# # !! Також важливо - коли ми імпортуємо math - ми отримцємо доступ до усього модуля. він виконається увесь
# import math
# # щоб стукнутись надалі до якоїсь функції імпортованого модуля, прописуємо її через крапку
# print(math.sqrt(16))

# # Але можна отримати доступ лише до функції, яка нам потрібна, щоб не тягнути увесь файл
# # таким записом ми дістаємо референс на цей об'єкт
# # !! ВАЖЛИВО - модуль - це по факту сінгелтон - він створить об'єкт лише один раз, коли імпортує і далі буде звертатись до методів за посиланням (тобто об'єкт буде в 1 екземплярі)
# # Що буде швидше - витягти модуль чи конкретний метод - побарабану - це буде референс - це більше питання чистоти коду (в конвеншені - до 6 по методам  - більше - увесь модуль)
# from math import sqrt

# # Маємо можливість через as перейменовувати назви методів, які імпортуємо
# # !! (покопати це докладніше про питання референсів в пайтон) це дає нам можливість, тому що в пайтоні усе є об'єктом - тому нема проблем з референсами
# import math as m
# from math import sqrt
# from math import sqrt as square_root

# print("This is lesson 08")

# # щоб стукнутись надалі до якоїсь функціх імпортованого модуля, прописуємо її через крапку
# print(math.sqrt(16))
# print(square_root(16))
# print(sqrt(16))
# print(m.sqrt(16))
# print(__name__)


# # IMPORT - як працює - як саме пайтон шукає по ключовому слову імпорт?
# #  є послідовність від шукання модулів і пекеджів - 
# # і перше що є це BuiltIn модулі - це ті, що є оголошені в самій системі, або були поставлені в енвайрмент(коли доставляєм у проект з pip бібліотеки)
# # друге - це User Defined - це те, що є у нас в сорсах - папки, файли, що ми самі створили(оголосили) в проекті

# # В пайтон також є такі 2 базових модулі sys і os
# # sys - відповідає за роботу пайтона і його системних речей
# # os - відповідає за оперейшн систем - за зовнішнє - 
# import sys

# # pprint - Звичайний print() усе виводить «в одну лінійку», а pprint робить форматування з відступами. (вигляжає як json)

# from pprint import pprint
# # sys має змінну path - вона виводить набір дерикторій, які в нього є, у вигляді списку стрінгів: (про це мав Любомир ще наголосити на класах - але не розумію до чого тут зауваження, що це саме стрінги)
# # 1 - перша - це дерикторія і файл з якої запускаємо (не дерикторія - де є консоль - а саме файл з якого запустили програму)
# # !!!! ВАЖЛИВЕ ПРАВИЛО - рутом проекту буде вважатися дерикторія того файлу, який ми запускаємо - (для user definition саме так)
# # тому в проектах пайтон __main__, app - завжди стоїть в руті проекту, щоб не бавитись зі шляхами (типу я є в рут і я буду бачити відносно внутрішніх усе що є)
# # Далі ще 2 важливі директорії - це Lib і в ній є директорія site-packages
# # В Lib стоять ті пекеджи і директорії, що поставились нам разом з пайтоном (builtin, math - усі там)
# # В site-packages - коли робимо pip instal - усе що будемо ставити зовнішнє - буде тут (або ми можемо самі скопіювати директорію фреймворку в GitHub і стягнути в цю папку)

# pprint(sys.path)
# якщо хочемо витягнути усі методи в поточний можуть з іншого - ставимо * і dir покаже їх в поточному модулі
# # from math import *

# # з dir Можна дістати усі методи з модуля і подивитись які там є - якщо нічого в неї не передаємо - то поверне що є у скоупі - в поточному файлі
# print(dir())
# # можна ліставати декілька одразу і які потрібно перейменовувати тут же
# from math import log, log2 as l2, log10 as l10, cos, sin, tan



# Далі створюємо власний модуль - файл my_func.py
# імпортуємо його сюди і запускаємо - і бачимо в консолі друк з функції, яка лжить в my_func
# бо під час імпорту код в модулі повністю виконався увесь
# але ім'я вже буде my_func - бо запустили ми файл lesson08, а не той де функція викливала name - він і показав тепер ім'я модуля де ця функція є - main для неї буде в тому вибадку, якщо запустити там, де пропвсаний виклик name
# пайтон пише main на виклик __name__ лише у файлі, який раниться
#  і часто так пишуть перевірку - щоб виконати певні дії у файлі, що буде рутом
# if __name__ == "__main__":
    # print_module_info()
# import my_func
# from my_func import print_module_info
# my_func.print_module_info()
# print_module_info()
# print(__name__)



# ПЕКЕДЖІ
# щоб створити пекедж достатньо створити дипекторію в проекті і додати туди модуль або ще папки і потім модуль
# створюємо папку в ній файл і папку в середині якого теж є файл
# і з відси - як з рута проекту ми 
# from level1 import l1
# якщо требадостукатись по директоріям - через крапку
# from level1.l1 import print_l1_info
# from lessons.lesson07.lesson07 import print_user_info
# print_l1_info()
# from level1.level2 import l2
# from level1.level2.l2 import print_l2_info
# print_l2_info()

# тут ми імпортуємо по факту пекедж level1, але так як ми в ньогму створили ініт і імпортували вже туди усе з пекеджу level1 - то ми матимемо доступ до усього що потрібно
# import level1
# level1.pl1()
# level1.pl2()

# це типу приклад як поламати систему, щоб вона могла достукатись до інший директорій проекту - але так не треба робити - у виключний випадках так можуть робити DevOps
# import sys
# from pprint import pprint
# pprint(sys.path)
# sys.path.append("C:/data/github/ua4589pf/lessons")
# pprint(sys.path)
# from lesson07.lesson07 import print_user_info
# якщо працювати в пайЧарм - то в ньому можна писати так як нижче і доступатися - але це через те, що він сам допише в sys.path цюдерикторію
# тому ми самі маємо розуміти, що проект буде будуватись від рутового модуля, а не як ми побудували там собі директорії - і ми маємо це розуміти - бо IDE роблять якісь речі за нас і можна потім і не знати як воно на справді працює
# from lessons.lesson07.lesson07 import print_user_info
# print(print_user_info("John", 30, "New York"))

# Щодо структури проекту:
# залежить від проекту - що саме веб чи щось інше
# + якщо є якась бібліотека - то часто вона може вимагати певної структури, щоб з нею нормально взаємодіяв проект (0:55 хв)

# меджик змінні - для перегрузки операторів і би багато де в пайтоні будемо це робити
# змінна __all__ - може бути викликана в будь-якому модулі - і вона перевизначає *
# додали в модуть l1 змінні а, _а, __а
# * - імпортує усе, що є паблік - але ми можемо це перевизначати (зробити у файлі l1 # __all__ = ["print_l1_info", "__a"])
# base_dir = set(dir())
# from level1.l1 import *
# import level1.l1
# але в пайтоні ці захисти пеалізовані на рівні захисту від дурака - бо є можливість достукатись до усього що є в можулі усе одно
# print(level1.l1.__a) # ось так напряму можу дістати прайвед
# import level1.l1 as l11
# print(l11.__a)



# print(set(dir()) - base_dir)

import sys
from pprint import pprint
pprint(sys.path)

# ПРАВИЛА ІМПОРТУ
# спочатку йдуть імпорти, потім фром, і за назвами в алфавітному порядку



# PIP (PyPI https://pypi.python.org/pypi) - можна на цей сайт розміщувати свої бібліотеки, але вони мають відповідати правилам і стандартам конвеншену
# зараз коли ставимо пайтон - зразу ставиться утиліта з pip (раніше було окрема бібліотека) - якщо треба ставити - можна зробити - як? - 01:15:00 відео
# є ще пекедж менеджер Конда - в ній ще більш відсіяні по сек'юрності проекти (її треба доставляти - є сайт https://docs.conda.io/projects/conda/en/stable/user-guide/getting-started.html)
# ставиться через команди в терміналі
# є команда pip list - покажу усі бібліотеки, що є поставлені
# pip freeze - список поставлених бібліотек з версіями
# ще є pip freeze > requirements.txt - виведе список freeze, але у файлі з ім'ям requirements.txt , який додасть до проекту у основну папку проекту
# (цей знак > - це є властивість терміналу - це не від pip команда) - це щоб поміняти потік виведення (можна вказати конкретний файлик щоб вивів)
# такий файлик це зручно, щоб передати іншому розробнику, який побачить які треба доставиіи бібліотеки для роботи з даним проектом
# і тоді модна зробити просто pip instal -r .\requirements.txt - натистути ентер і поставляться усі бібліотеки, що прописані у файлі
# !! ну і коли доставляємо бібіліотеки, то повторювати команду pip freeze > requirements.txt - щоб список бібліотек був актуальним

# як ставити бібліотеки:
# 1  команда virtualenv .env - треба створити віртуал інвайрмент
# бо є таке поняття як глобальні і локальні репозиторії відносно проекту - правильно завжди мати під проект свій енвайрмент - куди будуть лягати зовнішні бібліотеки
# в пайчарм там відразу він пропонує створити аткий енвайрмент
# 2 - активувати енвайрмент!!! - IDE коли бачить створений енвайрмент після комадни (virtualenv .env)  - активує його = PS C: \data\github\ua4589pf> & C: \data\github\ua4589pf\.env\Scripts\Activate.ps1 (в моєму випадку буде не Scripts, а Bin (в Mac - юнікс системах))
# але в мене не активував - я сама активувала і тоді запрацювали команди pip - бо залишаючись на глобальному - не працюють
# можна так само деактивувати, якщо прописади deactivate
# створення енвайрменту переналаштовує проект і змінює де шукати бібліотеки (і тепер коли ми викличемо sys.path - то site-package буде вже в папці .env
# pip list команда тепер автоматично шукатиме в інвайрменті
# 2 - вже ставити потрібну бібліотеку з pip

# pip команди:
# install - встановлює бібліотеку в інвайрмент
# • download - стягує сорси - клонує (розібратись як його використовують)
# • uninstall - видалити
# • freeze - список встановлених з версіями - в потрібному форматі для реквайментс
# • list - список встановлених
# • show - покаже інфу про бібліотеку
# • wheel - Build wheels from your requirements.
# • hash - Compute hashes of package archives.
# • completion - A helper command used for command completion
# • help - Show help for commands.

# робота з pyOWN в модулі app.py
# регулярки - файл regex.py