def print_module_info():
    print(f"Module name: {__name__}")
    print(f"Module file: {__file__}")
    # print(f"Module path: {__path__}")

# якщо викличемо тут же - матимемто вивід:
# print_module_info()
# Module name: _main_ # бо запустили звідси
# Module file: c:\data\github\ua4589pf\lessons\lesson08\my_func.py # __file__ - покаже шлях до модуля

# Якщо прописати так, то код буде виконуватись лише тоді, коли програма буде запускатись з цього модуля
# А якщо його імпортувати - то код не виконається при виконанні модуля під час імпорту, бо умова не виконається
# це пішло з плюсів - програма починається з функції main
# !!! РОЗІБРАТИСЯ - ЯК ЗАПУСКАЄТЬСЯ ПРОЕКТ???? взагалі)))
#  ця функція є замкнена
if __name__ == "__main__":
    print_module_info()