# while - цикл з умовою - працює доти, доки умова виконується (використовуємо коли не можемо розрахувати точну кількість ітерацій, а є лише умова, яка має виконуватись)
# обов'язково умова має бути така, що завершить своє виконання під час виконання коду ітерацій - бо буде вічний цикл.
# for - цикл перебору - працює до кінця довжини об'єкту, який перебираємо, або до кінця вказаного проміжку (коли знаємо кількість ітерацій - це або довжина масиву, який перебираєсмо, або якогось ітерабельного об'єкта, або діапазону)
# але треба враховувати якщо ми можифікуємо об'єкт, який перебираємо - щоб він не збільшувався і ми не попали у вічний цикл в for
# 
# для обох таких цфклів є блок else - (опційний) - відпрацьовує по завершенню роботи усіх ітерацій циклу (окрім випадків, якщо цикл був перерваний break)
# не створюють власних скоупів 
# !!!!!!!! (але обережно, якщо змінна не створилась в середині циклу, бо спрацював break або не зайшло в умову, де створюється змінна, а ми потім звертаємось до неї далі у коді - буде помилка!)

# for i in "text":
#     print(i)
# print("end script")
# a = 0
# while a < 10: (поки а менше 10)
#     print(a)
#     a += 1

# while True:
#     pass

# print("end script")


# l = [1,2,3,4,5]
# while l: (поки ліст не є пустим - тобто він буде істиною)
#     print(f"remove {l.pop() =}")
#     print(l)
# else:
#     print ("The end")
# print("end script")


#  Функція range
# використовується часто, щоб згенерувати індекси для того, щоб перебрати і модифікувати ітерабельний об'єкт у циклі for

# чистий range(5) - поверне об'єкт range(0, 5)(багато білд ін функцій будуть повертати такі генератори) - він є ітерабельним насправді
# print(list(range(5))) # можемо конвертнути його в ліст - поверне ліст від 0 до заданого числа
# print(list(range(-5))) # поверне пустий ліст (бо від 0 до -5 він дефолтно іде з кроком 1.)
# print(list(range(-10, -5))) # але можна вказувати діапазон і буде повертати вказані числа
# print(list(range(-10, -50))) # але треба вказувати правильно числа у від'ємному значенні (бо рахунок буде з кроком 1, а не -1) - тут буде знов пустий ліст
# print(list(range(-10, -50, -1))) # або можна вказати крок і буде працювати з вказаним кроком
# print(list(range(-10, -50, -10)))

# for i in range(5): # на цьому моменті згенерувався ліст від 0 до 5
#     print(f"{i=}") # де for по елементно забрав кожен елемент

# for створює змінну в середині себе, і коли ми будемо модифікувати елементи перебираємого масиву, то в кінці кінців - сам масив, який зберігається в змінній перед перебором - не зміниться
# будуть змінюватись елементи під час перебору, але вони не записуються в основний масив
l = [1,2,3, [10, 20,30]]
# for i in l:
#     print(f"{i=}", end=" => ")
#     if type(i) is list: 
#         for e in range(10, 20, 2):
#             i.append(e) # якщо записати так, то промодифікується і базовий ліст в середині ліста l, який перебираємо 
#             # (так як ми беремо референс, бо list це mutable об'єкт)

#     i = i*2 # а ця дія НЕ модифікує значення в середині основного ліста l, бо ніде не зберігає ці зміни 
#     # (якщо зробимо тут i.append(і) - зациклимо. В цьому випадку треба зберігати в додатково створений масив)
#     print(f"{i=}")
# print(l)


# як ми можемо зберігати все ж таки зміни за допомогою range
# за допомогою наступного запису ми генеруємо індекси для значень ліста за допомогою range
# for i in range(len(l)):
#     print(f"l[{i}]={l[i]}", end= " => ")
#     l[i] = l[i]*2 # таким чином ми звертаємось до індекса і переписуємо туди значення
#     print(f"l[{i}]={l[i]}")

# print(l)


# приклад того що range є генератором і його розмір завжди однаковий, не залежно від розміру вказаного в ньому діапазіні 
# - бо його розмір - це розмір його тіла функції(прописаного коду), який генерує числа, 
# а які будуть числа - він їх не зберігає - він їх видає і функція засинаю.
# + генератори є трохи повільніші(він не створює масив індексів відразу, а генерує по одному в момент перебору), але є ефективні по пам'яті. А ліст - він масивний - так можна швидко по індекси дістати елемент, але якщо багато значень, то важко
# генератори теж ітерабельні обяєкти

# for i in range(1, 5):
#     N = 10 ** i
#     r = range(N)
#     l = list(r)
#     print(f"{N=}")
#     print(f"\t{r.__sizeof__() =}") # розмір байт ренжа
#     print(f"\t{l.__sizeof__() =}") # розмір байт ліста


# є аналог того як працює range, але коли треба доступ до значеня - то enumerate
# - то є білд ін функція enumerate - для ітерабельних теж, і теж є генератором
# результатом enumerate - є набір tuples з індексом і значенням ітерабельного об'єкту, який ми передали у функцію enumerate
#  !(але коли теж (як і range) поміщаємо це в ліст) - якщо зробити прінт enumerate("text") - буде просто об'єкт і його номер надруковано
# але коли поміщаємо в for, то не треба ліст робити, він і так розуміє, що це щось ітерабельне і можна працювати і перебираті значення

# l = enumerate("text")
# print(l, list(l))
# l = enumerate([10, 20, 30, 40, 50])
# print(l, list(l))
for elemnt  in enumerate([10, 20, 30, 40, 50]):
    print(f"{elemnt=}")

# таки
# a, b = 1,2
# a, b = (1,2) # приклад того як можна зберігати значення в tuples

# тому тут так само можна з enumerate перебирати відповідно за подібним (як зверху) записом, зберігаючи індекси і значення в tuple
# for index, value  in enumerate([10, 20, 30, 40, 50]):
#     print(f"{index=} {value=}")

# перебирати можна будь що ітерабельне - приклади:
# for i in "text":
#     print(f"{i}")
# for i in [1,2,3]:
#     print(f"{i}")
# for i in (1,2,3):
#     print(f"{i}")
# for i in set("qweewqewqewqewqe"):
#     print(f"{i}")

# в dict буде перебирати значення ключів, за ключами вже можем стукатись до значень
# d = {
#     "key1":1,
#     "key2":3,
#     "key3":3,
#      }
# for i in d:
#     print(f"{i} {d[i]}")
# у дікта ж свій метод, який працює як enumerete - повертає набір tuple
# for i in d.items():
#     print(f"{i}")
# for key, value in d.items():
#     print(f"{key} {value}")
# 


# ключові слова для зупинку циклу, або ітерації (працюють для while і for)
# break - зупиняє повністю цикл
# continue - зупиняє роботу поточної ітерації

# s = 0
# for i in range(10):
#     s += i
#     print(f"{i=} {s=}")
#     if s > 10:
#         break
# else:
#     print("end")
# print("end script")

# text = input("set text:")

# приклад використання else для флажків (чи щось true чи false)
# але так використовують рідко - типу else важкий і сильно замудрено - краще напишуть флаг через if і додаткову змінну флагу (код є у відео)
# for c in text:
#     a = 1
#     if c == "1":
#         break
# else:
#     print("not contain ")


# print(a) # тут може бути помилка, бо змінна не створиться, якщо не вписати тест в змінну text вище і цикл не виконається і не створить цю змінну


# continue

s = 0
for i in range(10):
    s += i
    print(f"{i=} {s=}")
    if s % 2:  # (тобто коли будуть парні - то спрацює continue і почне ітерацію заново - код нижче continue (print("text")) НЕ виконається
        continue
        print("text") # важливо!!! код, який має виконатись після continue - має бути не на одному рівні по табу з continue а вийти на таб назад (як в наступному рядку). Код синтаксично прямо під continue - ніколи не виконається!
    print("text") # цей код виконається лише, коли не виконається умова if s % 2: і не спрацює continue
else:
    print("end")
print("end script")

# коли один цикл запускає інший
# for i in range(3):
#     print(f"{i=}")
#     for j in range(3):
#         print(f"\t{j=}")
#         for k in range(3):
#             print(f"\t\tf{k=}")

# якщо є break або continue у вкладених циклах, то вони спрацьовують лише в тому циклі, в якому викликаються 
# - тобто брейк поверне просто на цикл вище, а не вийде з усіх циклів)
# for i in range(3):
#     print(f"{i=}")
#     for j in range(3):
#         print(f"\t{j=}")
#         if (i + j) % 2:
#             print("\tcontinue")
#             continue
#         for k in range(3):
#             print(f"\t\t{k=}")
#             if (i + j +k) > 3:
#                 print("\t\tbreak")
#                 break


# pass - заглушка коду - просто потім по цьому слову знайти де що нам треба допрацювати, що ми пропустили
# for i in "text":
#     pass
# def f():
#     pass


# for n in range(0, 101, 2):
#     print(n, end=" ")
# print()

# n = 0
# while n <= 100:
#     if n % 2 == 0:
#         print(n, end=" ")
#     n += 1
# print()

# a = range(100)
# for i in a:
#     if i % 2 == 0: 
#         print(n, end=" ")
# print()


# n = 0
# while n < 100:
#     if n % 2 == 0:
#         print(n)
#     n += 1
# # ------------------------------------------
# for n in range(0, 100):
#     if n % 2 == 0:
#         print(n)

# a = range(100)
# for i in a:
#     if i % 2 == 0:
#         continue
#     print(i)


# for n in range(101):
#     if not n%2:
#         continue
#     print(n)

# for n in range(1,101,2):
#     print(n)


# for i in range(1, 100): if i % 2 == 0: continue print(i)
#  #--------------------------------
# for i in range(1, 100): 
#     if i % 2 != 0:
#         print(i)

# a = [2,2,2,2,2,2,2,1421,5,6,5]
# for n in a:
#     if n%2:
#         print(n,"is odd")
#         break
#     print(n)

from random import randint
a = []
for i in range(10):
    a.append(randint(-10, 10))
print(a)
print(type(randint(-10, 10)))
# 
# for n in a:
#     if n%2:
#         print(n,"is odd")
#         break
#     print(n)


# list = [2, 4, 6, 8, 11]
# odd = False
# for n in list:
#     if n % 2 !=0:
#         odd = True
#         break
# if odd:
#     print("founded odd")
# else:
#     print("no odd")


# for n in range(0, 120):
#     if n % 2 == 1:
#         print(n)

# for n in range(100):
#     if not n%2:
#         continue
#     print(n)



# a = [2,2,2,2,2,2,2,1421,5,6,5]
# for n in a:
#     if n%2:
#         print(n,"is odd")
#         break
#     print(n)

# list = [2, 4, 6, 8, 11]
# odd = False
# for n in list:
#     if n % 2 !=0:
#         odd = True
#         break
# if odd:
#     print("founded odd")
# else:
#     print("no odd")