class Point:
    def __init__(self, x=0, y=0, z=0):
        self.x = x
        self._y = y
        self.__z = z
    
    def __str__(self):
        return f"Point({self.x}, {self._y}, {self.__z})"

# гетери, сетери - так звані пропетріз
# атрибути класу мають бут исховані, якщо вам потрібно до них достукуватись - вам потрібно визначити гетери, сетери - функції, які достукуються до відповідних атрибутів, щоб дістати значення або записати
# тобто створюємо окремі методи для діставання значенняі. для запису нового значення (потрібно, щоб мати можливість контролю - прописувати якісь обмеження на запис чи на считування в залежності від потреб або логери писати що де змінюється і тд)
    def get_y(self):
        print("Getter for y called")
        return self._y
    def set_y(self, value):
        print("Setter for y called")
        if value < 0:
            self._y = 0
        else:
            self._y = value
    # можна написати через проперті тепер і Y буде приймати можливості прописані в гетері і в сетері - і відповідно реагує коли ми хочемо записати чи прочитати значення
    # такий запис - це старий підхід
    y = property(get_y, set_y)

# такий запис - це по новому (прописується @property під ним метод, який читає значення - далі важливо передати @z.setter - і назву використати таку саму як назва методу вище = z - і прописуємо метод для сету)
    @property
    def z(self):
        print("Getter for z called")
        return self.__z
    @z.setter
    def z(self, value):
        print("Setter for z called")
        if value < 0:
            self.__z = 0
        else:
            self.__z = value

# приклад того, що пайтон не підтримує оверлоаду - методи з однаковими назвами, але різною кількістю параметрів, за якими можна зрозуміти, що це різні методи
    def print_info(self):
        print(self.x, self._y, self.__z)
    def print_info(self, prefix):
        print(prefix, self.x, self._y, self.__z)

# приватність властивостей
# p = Point(1, 2, 3)
# print(p)
# print(p.x)
# print(p._y)
# print(p._Point__z)  # name mangling 
# p._Point__z = 10
# print(p)

# читання і запис через методи get set
# p.set_y(20)
# print(p.get_y())
# p.set_y(-20)
# print(p.get_y())

# використання проперті
# p.y = 30
# print(p.y)

# новий підхід
# p.z = 40
# print(p.z)
# print(p)

# p.print_info("Custom prefix:")
# # p.print_info()

# приклад як ми бачимо усі атрибути і методи класу як dict - і так як для функції ключем є назва функції (а в пайтоні в тіло функції входитьі сигнатура(параметри її) і воно буде як значення)
# в інших мовах, що підтримують оверлоад - там визначається назва функції разом з параметрами, а тіло окремо. В пайтон(і всі інтерпритовані мови) лише назва - тому нема оверлоаду
p = Point(1, 2, 3)
print(p.__dict__)
for key, value in Point.__dict__.items():
    print(f"{key:<25} : {value}")