# Створення будь-якого класу - це є розширення програми своїми типами даних.
# В Python усе являється об'єктом
# Об'єкт - це будь-який колекції даних якими ми можемо маніпулювати, витягувати дані і таке інше
# Складається об'єкт з двох речей - колекції даних(змінні) і методи(функції) - те, що може бути викликане від даного об'єкту
# Метод - це функція, але має можливість передавати як перший параметр той об'єкт на якому викликається
# Клас - це об'єкт в Python, який є частвоко і шаблоном і повноцінним об'єктом (у випадку компільованих мов - це прототип - шаблон для створення і все)
# клас створює власний скоуп
# Також маємо ініціалізацію - це процес створення об'єкту (екземпляр класу) - конкретний представник цього класу

# і буде такі два поняття об'єкт класу і об'єкт інстансу
# приклад:
# list - буде об'єкт класу - це буде посилання на об'єкт класу list
# print (type(list), list) # <class 'type'>, <class 'list'>
# а коли ми вже проініціалізували його - передали значення - то це вже об'єкт інстансу
# тобто l вказує вже на інстанс породжений цього класу
# l = [1, 2, 3, 4, 5]
# print(type(l), l) # <class 'list'>, [1, 2, 3, 4, 5]


# Python це мова з кількома парадигмами - підтримує різні підходи до програмування.
# Один з популярних - це ООП - щоб ми розуміли певну сукупність набору даних як єдиний об'єкт
# Об'єкт маж дві характеристики - атрибути і поведінка

# Мова підтримує ООП в тому випадку якщо вона підтримує 3 такі принципи:
# Наслідування(Спадкування) - процес використання деталей нового класу без зміни існуючого класу
# Здатність одного типу даних наслідувати властивості іншого (дає можливість не переписувати одін і той же функціонал)
# Інкапсуляція - Приховування привантих деталей класу від інших об'єктів (як приховування доступу до атрибутів так і до реалізації) - типу як метод сорт - ми його приміняємо, але не турбує як саме воно це робить
# Поліморфізм - концепція використання спільних операцій різними способами для різних вхідних даних 
# (здатність мати різну поведінку в одному і тому ж самому методі в залежності від типу даних на якому він викликається


# Для назв класів використовується КамлКейс
# при наслідуванні від інших класів прописуємо такі класи в дужках через кому. Але зазвичай стараються не наслідуватись більше ніж від 1 класу
# якщо ми не наслідуємось від жодного класу - під капотом новий клас буде наслідуватись від класу object(це так в 3 версії стало - раніше в 2 версії руками прописати мали наслідування від object) 
# У ньому також є спеціальні атрибути, які починаються з подвійного підкреслення (__).
# Наприклад, __doc__ надає нам рядок документації цього класу
# Докстрінга задається першим рядком в середині класу, як і у функції

# отже створюємо клас:
# class MyClass:
#     """MyClass docstring"""
#     pass

# print(type(MyClass), MyClass) #тутпобачимо тип класу type - так як це буде без ініціалізації просто посилання на об'єкт і <class '__main__.MyClass'>
# obj = MyClass() # створюємо об'єкт класу
# print(type(obj), obj) # тепер бачимо тип нашого класу саме на main <class '__main__.MyClass'> і посилання на об'єкт - так як в ньому ще нема даних і він пустий
# print(type(obj) == MyClass) # отримаємо true - так як ми створили по факту тип даних, якій є тепер для obj


# У термінології Python члени класу називаються атрибутами, функції класу – методами, а поля класу – властивостями (або просто атрибутами).
# Визначення методів подібні до визначень функцій, але (за деякими винятками, про які нижче) методи завжди мають перший аргумент, який викликається за загальноприйнятою угодою self:

# Атрибути є двох типів - атрибути класу, атрибути інстансу - і в них різна поведінка
# class Temp: 
#     cm = ["a", "b", "c"] # атрибут класу mutable
#     ci = 0 # атрибут класу immutable
#     def __init__(self):
#         self.im = [1, 2, 3] # атрибут інстансу mutable
#         self.ii = 100 # атрибут інстансу immutable
# далі код до методів:
#     def print_info(self):
#         print(self.cm, self.ci, self.im, self.ii)

# Створюємо об'єкти
# t = Temp()
# t2 = Temp()
# перевіряємо типи
# print(type(t), t)
# і можемо достуватись до атрибутів первного окремого створеного об'єкту класу
# print(t.cm, t.ci, t.im, t.ii)
# print(t2.cm, t2.ci, t2.im, t2.ii)
# І тепер ми можемо змінювати значення для кожного окремого об'єкту класу і його власного інстансу
# Але для окремих інстансів в окремих об'єктах ОКРЕМО ми можемо змінювати лише атрибути інстансу:
# t.im.append(4) # додасть 4 до ліста саме в об'єкті t і його атрибуті im - буде [1,2,3,4]
# t2.im.append(50) # додасть 50 до ліста саме в об'єкті t2 і його атрибуті im - буде [1,2,3,50]
# t.ii += 1 # додасть +1 до значення саме в об'єкті t і його атрибуті ii - буде 101
# t2.ii += 20 # додасть +20 до ліста саме в об'єкті t2 і його атрибуті im - буде 120
# !!! Коли змінимо атрибути класу (які не в методі __init__) - змінимо такі атрибути в усіх об'єктах цього класу:
# t.cm.append("d") # отримаємо зміну для t b t2 їх атрибутів cm = [a, b, c, d] і обох об'єктах класу
# print(t.cm, t.ci, t.im, t.ii)
# print(t2.cm, t2.ci, t2.im, t2.ii)

# Чому така поведінка?
# Бо атрибути класу є спільні для усіх його об'єктів, створених від цього класу - далі пояснення як це відбувається:
# # print(dir(t)) # покаже усі методи, які можна викликати на цьому об'єкті і тут побачимо увесь список змінних, які маємо в класі
# але dir не повертає те, що є в середині йього об'єкту - повертає те, що може бути викликане від цього об'єкту
# він задіває наслідування і показує усі методи усіх класів вище
# якщо треба побачити чітко що є в якомусь об'єкті - треба викликати змінну __dict__ 
# - так як у python усі об'єкти діктоподібні - він завжди шукає ключ і повертає значення
# print(Temp.__dict__) # виклик від класу - тут побачимо, що є сm i ci з їх значеннями і перелік статік атрибутів ii та im, та інші меджік речі
# print(t.__dict__) # виклик від інстансу - тут ми бачимо лише ii та im з їх значеннями
# print(t2.__dict__) # виклик від інстансу - тут ми бачимо лише ii та im з їх значеннями

# як взагалі формується клас і його атрибути і інстанси:
# є клас зі своїми атрибутами, які сказують на якісь об'єкти
# потім ми створюємо def __init__ і інстанси t і t2 - в яких є свої атрибути, які ми прописали в init і вони передаються окремо кожному інстансу через self
# але інстанси класу(кожен з них) знють він якого типу(класу) вони походять (object теж тип від якого походять усі класи)
# і коли ми пробуємо від якогось obj. (після крапки ми пробуємо знайти щось - на справді python, коли бачить крапу далі він пробує знайти такий ключ(так як усі об'єкти діктоподібні - кожен об'єкт - це є dict в якому є ключ і значення - назва об'єкту ключ - дані, тіло функції(разом з аргументами), те що в середині об'єкту - це значення))
# і коли він не знаходить там від чого ми викликаємо - він посинає шукати там від чого походить об'єкт на йякому викликано метод (і виходить коли ми стукалить до t.cm та t.ci - він не знаходив їх в t, а пішов в Temp, від якого походить t і там змінив значення і тоді автоматично t2 отримав нове значення теж, бо він також походить від Temp)

# і тут ми маємо розуміти, що так само буде стуватись і до методив object - такі як str, print та інші і ми можемо з ними працювати
# МЕТОДИ
# створюєм їх в середині класу(вище в класі Temp метод print_info):
# t.print_info() # можемо тепер просто викликати метод, який прінтить усі ті самі атрибути, що ми прінтили вище кожного разу прописуючи (тепе використовуються self, щоб метод брав об'єкт на якому викликається як аргумент і прінтив йтого значення за вказаними атрибутами)
# t2.print_info()

# ! Також так як метод - це функція - ми можемо її окремо зберегти в якусь змінну і вона буде просто виконувати свої дії як функція f
# f = Temp.print_info
# f(t) # тепер ми в неї маємо передати аргумент як у функцію, вона вже не буде працювати як метожд. який можна викликати на об'єкті, який автоматом стане і аргументом
# print(type(Temp.print_info)) # тип function
# print(type(t.print_info)) # тип method
# print(type(f)) # тип function

