# 
# self - це референс на об'єкт, від якого викликається метод і бере його як перший аргумент
# можна називати не self - а будь-як - як нижче є point і point1 - просто посилання на об'єкт буде поставлено автоматом на 1 аргумент, якщо викликати метод на певному об'єкті класу

# class Point:
    # коли ми інітимо - то відбувається так - створюється об'єкт і ініт бачить, що приходить до нього пустий об'єкт self і в нього треба додати наступні параметри x i y
    # сам інстанс - це є об'єднання методів __new__ i __init__ - тому що ініт по суті ініціалізує вже створений об'єкт (йому на момент його виклику в його селф прилітає вже створений об'єкт відповідного класу - пустий, в якому є лише прив'язка до цього класу і далі ми його ініціалізуємо, розширяємо)
    # технічно можна перегрузити __new__ - він відповідає за створення об'єкту в пам'яті і його результат прилітає ініту, але так треба робити лише якщо розумієш для чт=ого
#     def __init__(self, x=0, y=0):
#         print(f"Calling Point.__init__ with x={x}, y={y}")
#         self.x = x
#         self.y = y
    # ми можемо також видалити об'єкт - перегрузити деструктор
#  коли програма відпрацювала - відпрацює del (але є гарбедж колектор і нам не треба перегружати del в основному - теж лише для специфічних задач, наприклад логування) - дефолтно об'єкт видалиться, коли на нього не буде жодного посилання
#     def __del__(self):
#         print(f"Calling Point.__del__ for Point_x({self.x}, {self.y})")

#     def move(point, dx, dy):
#         point.x += dx
#         point.y += dy

#     def distance(point1, point2):
#         print(f"Calling Point.distance with {point1}, {point2}")
#         return ((point1.x - point2.x) ** 2 + (point1.y - point2.y) ** 2) ** 0.5
# метод __str__ викликається коли ми хочемо об'єкт привести до типу str
# і коли ми викликаємо print - в середині нього він приводить передані дані в str і викликає щоразу __str__
# якщо в мене в класі немає описаного __str__, то він його візьме з object
# але ми можемо собі "перезавантажити"(зробити оверайд - поміняти поведінку методу - поліморфізм) будь який метод з object за потреби в середині класу (під свій власний тип)
#     def __str__(self):
#         print("Calling Point.__str__")
#         return f"Point({self.x}, {self.y})"

# приклад до видалення об'єкту (якби ми тут зберігали значення ззовні в p - то не видалисвя б об'єкт автоматом)
# def foo():
#     p = Point(3, 4)
#     print(p)
#     print("Exiting foo()")
# print("Creating point p in foo()")
# foo()
# print("main Exited foo()")

# p1 = Point(1, 2)
# p2 = Point(4, 6)
# print(p1) # без описаного методу __str__ в середині класу виводим просто референс на об'єкт - бо він не знає як привести до стрінги запис Point(1, 2) - це для нього новий не визначений тип даних
# print(p2) # коли ми прописали в __str__ як саме перетворювати в стрінгу в середині класу - тепер print розуміє як перетворити в стрінгу і виводить заданий нами текст.
# print("Distance:", Point.distance(p1, p2)) # є технічна можливість виводити дані від класу і друкувати, передавши обидва аргументи (бо self тут не спрацює - нема інстансу класу, який можна взяти за перший параметр)
# print("distance:", p1.distance(p2))  #в такому записі ми передаємо першим аргументом p1 і буде результат такий як зверху - але такий запис правильніший - треба працювати з інстансами, а не напряму з класами #(не знаю що це за ворнінг в нього виводився - все працювало) This will raise an error
# Point.move(p1, 2, 3)
# p1.move(2, 3)
# print(p1)
# s = str(p1)
# print(s)


# Конструктори
# це один з меджік методів = їх там назвав сам творець пайтона
# магічні - бо він сховав за певні назви методів, які будуть називатись певним чином певний функціонал
# мв їм даємо правильні назви, а вони будуть відпрацьомувати інше (в С++ - це перегрузка операторів)
# і один з таких методів це є __str__, який ми вже перезавантажували (який працює невидимо в середині print)
# і таким самим меджик методом є __init__, який викликається, коли ми створюємо новий об'єкт інстансу класу



# МАГІЧНІ МЕТОДИ НАЗВИ І ПЕРЕГРУЗКА (ОВЕРЛОАД): є набір назв методів, які ми можемо перегрузити (в презентації перегічені усі)
# нижче декілька прикладів
# використовуємо для того щоб перегрузити поведінку в новому типі - бо Python з його стандартними методами - не знає як маніпулювати в ручну створеним новим типом (додавати його чи щось змінювати зі стандартними методами, тому ми їх переписуємо під наш клас)

import re


class Point:
    
    def __init__(self, x=0, y=0):
        self.x = x
        self.y = y

    def move(self, dx, dy):
        self.x += dx
        self.y += dy

    def distance(self, other):
        return ((self.x - other.x) ** 2 + (self.y - other.y) ** 2) ** 0.5

    def __str__(self):
        return f"Point({self.x}, {self.y})"
    
    def __repr__(self):
        return f"({self.x}, {self.y})"
    def __add__(self, other):
        return Point(self.x + other.x, self.y + other.y)
    def __lt__(self, other):
        # return (self.x, self.y) < (other.x, other.y)
        return self.distance(Point(0, 0)) < other.distance(Point(0, 0))
    def __le__(self, other):
        return (self.x, self.y) <= (other.x, other.y)
    
# p1 = Point(1, 2)
# p2 = Point(4, 6)
# print(p1)
# print(p2)
# print("Distance:", p1.distance(p2))
# p3 = p1 + p2
# print(p3)

# points = [Point(7, 8), Point(1, 2), Point(5, 6), Point(3, 4)]
# print(points)
# points.sort()
# print(points)


# НАСЛІДУВАННЯ - здатність успадковувати якусь поведінку
# наслідуємось від Point і будемо надавати кольори точкам
# треба задати свій bybn для класу - прописати параметри які нам потрібно приймати під час створення об'єкту - по дефолту чорний колір крапок
# далі за ключовим словом функції super() за допомогою якої можемо викликати метод поверхом вище - тому ми викликаємо метод init батьківського класу, (щоб мати доступ до його налаштувань точок?)
class ColorPoint(Point):
    def __init__(self, x=0, y=0, color="black"):
        super().__init__(x, y)
        self.color = color

# перезавантажуємо метод str щоб вмів друкувати і колір (якщо не перезавантажити - візьме його з поверху вище - з point, якби і там не було - то пішов би в object, якщо і там нема - то ерора)
    def __str__(self):
        return f"ColorPoint({self.x}, {self.y}, {self.color})"
    def __lt__(self, other):
        return (self.x, self.y) < (other.x, other.y)

    
cp = ColorPoint(1, 2, "red")
print(cp)
color_points = [ColorPoint(7, 8, "red"), ColorPoint(1, 2, "blue"), ColorPoint(5, 6, "green"), ColorPoint(3, 4, "yellow")]
print(color_points)
color_points.sort()
print(color_points)
print(cp.__hash__())

