# https://learngitbranching.js.org/

# git commit - m # закомітитись
# git branch bugFix # створити гілку bugFix
# git checkout bugFix # перейти на гілку bugFix

# merge
# Ми змержимо гілку bugFix в main.
# git checkout main # перейти на гілку main
# git merge bugFix (додай сюди(де ми стоїмо - на main) зміни з bugFix)

# Змержимо гілку main в bugFix.
# git checkout bugFix # перейти на гілку bugFix
# git merge main

# rebase
# Ми хочемо перемістити наші зміни з гілки bugFix прямо до змін з гілки main. Тоді це буде виглядати наче ці зміни були додані одна за одною, хоча насправді вони були додані одночасно.
# git rebase main (скопіюй зміни звідси(де ми стоїмо - на bugFix) на main - тобто гілка bugFix зі своїми змінами скопіюється в один ряд з гілкою main після її останнії комітів)
# але при rebase коміти з гілки bugFix будуть скопійовані, а стара гілка з комітами ще існуватимуть в дереві десь

# оновлюємо і main
# git checkout main # перейти на гілку main
# git rebase bugFix
# тепер і мейн має зміни з bugFix і вони стоять на одному коміті і мають увесь робочий матеріал

# HEAD
# Спочатку розберемось з "HEAD". HEAD це символьне ім’я поточного вибраного коміта -- по суті це той коміт з яким ти зараз працюєш.
# HEAD завжди вказує на найновіший коміт з робочого дерева. Більшість команд що змінюють локальне дерево комітів, також модифікують HEAD.
# Зазвичай HEAD вказує на ім’я бранча (наприклад bugFix). Коли ти комітиш, змінюється статус гілки bugFix й це можна побачити подивившись на HEAD.

# Відокремлюємо голову
# Detached HEAD (відокремлена голова) просто означає що HEAD посилається на коміт, а не на якусь гілку. 
# Ось як це виглядає спочатку:
# HEAD -> main -> C1
# git checkout C1
# А в стані detached head:
# HEAD -> C1

# відносні посилання
# вказувати коміти за хешем не найзручніша річ, через це git підтримує відносні посилання. Вони реально круті!
# З відносними посиланнями ти можеш почати з якогось зручного місця (наприклад гілки bugFix чи посилання HEAD) й вказати потрібний коміт відносно цього посилання
# Відносні коміти є дуже потужним інструментом, але ми почнемо з двох простих прикладів:

# Йдемо вверх на один коміт за допомогою ^
# Йдемо вверх на кілька комітів за допомогою ~<число>

# Розберемось спочатку з оператором каретки (^). Кожна каретка додана до посилання (напр. до імені коміту) вказує git що потрібно знайти батька посилання до якого застосована каретка.
# Тож main^ тотожнє до "перший предок посилання main".
# main^^ це дідусь (предок другого покоління) посилання main

# Ти також можеш використовувати HEAD з відносними посиланнями. Давай використаємо це щоб трошки піднятися по дереву.
# git checkout C3
# git checkout HEAD^
# git checkout HEAD^


# Оператор "~"
# Уявімо, що тобі потрібно піднятися досить високо вгору в дереві комітів. Було б трохи напряжно набирати ^ багато разів, тому Git також має оператор тильда(~).
# До оператор тильда (не обов’язково) можна дописати справа число, що вказує на яку кількість предків потрібно піднятися вверх. Подивимось на практиці
# git checkout HEAD~4

# Форсуємо гілку
# Один з найуживаніших прийомів де я використовую відносні посилання це переміщення гілок. 
# Ти можеш напряму переспрямувати бранч на якийсь коміт використавши опцію -f (force, тобто насильно). 
# Щось на зразок:
# git branch -f main HEAD~3  #Переміщує (насильно) гілку main на три предки позад HEAD.

# Відміна змін в Git
# Є декілька шляхів відмини змін в Git. 
# І так само як і коміти, зміни в гіт можна відміняти використовуючи або низькорівневі методи (додавання в коміт окремих файлів) так і високорівневі. 
# Є два основні шляхи відміни змін в Git -- перший це використовувати git reset й інший це git revert. 

# Git Reset
# git reset відміняє зміни переміщуючи вказівник гілки назад в історії на старіший коміт. 
# В принципі, можна вважати що це певне "переписування історії;" 
# Коли git reset перемістить гілку назад буде здаватися, що відмінений коміт взагалі ніколи не створювався.
# git reset HEAD~1

# Git Revert
# Команда reset чудово працює для локальних бранчів на власному комп’ютері, 
# але так як вона спричиняє "переписування історії", її не можна використовувати в ситуації коли кілька користувачів працюють з цим бранчем
# Для того щоб відкотити зміни й потім поділитися цими відкоченими змінами з друзями, потрібно використовувати git revert.

# "перенесення змін" -- іншими словами, це можливість розробника переміщувати коміти між гілками в простий та зручний спосіб.

# Git Cherry-pick
# Перша команда в цій серії називається git cherry-pick. Вона має наступну форму:
# git cherry-pick <Коміт1> <Коміт2> <...>
# Це надзвичайно простий спосіб вказати гіту що потрібно скопіювати серію комітів до поточного розташування (HEAD).

# Інтерактивний Rebase
# Git cherry-pick зручно користуватись, коли ти знаєш які коміти тобі потрібні (і ти знаєш їхні хеші) -- важко вигадати щось простіше.
# Але що робити в ситуації, коли ти не знаєш які коміти потрібні? На щастя git може впоратись і з цим! Для цього випадку використовують інтерактивний rebase -- це найкращий спосіб перевірити серію комітів які потрібно заребейсити.
# Інтерактивний rebase це насправді команда rebase з опцією -i.
# Якщо додати цю опцію, git відкриє діалог в якому покаже які коміти будуть скопійовані до кінцевого призначення. Він також покаже хеші комітів та їхні повідомлення, що допоможе розібратися що й до чого.
# В "справжньому" git, замість UI вікна відкриється файл в сконфігурованому текстовому редакторі, можливо vim. Для цього туторіалу я створив невеличке діалогове вікно що поводиться приблизно так само.

# Коли відкриється вікно інтерактивного rebase ти можеш зробити три речі:
# Ти можеш переставити коміти між собою просто змінивши їх порядок в діалозі (в нашому вікні ти зможеш перетягнути їх мишкою).
# Ти можеш повністю пропустити якісь коміти. В туторіалі потрібно вимкнути опцію pick, але в справжньому гіт потрібно просто видалити відповідний рядок.
# Також можна розчавити (squash) якісь коміти. На жаль наш туторіал не підтримує цю фічу (так як ми не підтримуємо роботу з файлами), але це дуже зручна опція в справжньому гіт. За її допомогою можна декілька різніх комітів об’єднати в один
# git rebase -i HEAD~4


# Локально складені коміти
# Ось ситуація з життя рядового програміста: я намагаюся відслідкувати баг, але це не завжди вдається. Щоб допомогти собі, я додаю кілька дебаг-команд та ще кілька println'ів.
# Всі ці команди для відлагодження та виводу данних знаходяться в своїх власних комітах. Врешті-решт я знаходжу баг, фікшу його та щиро радію!
# От тільки лишається проблема, що потрібно мій фікс перенести з bugFix назад в гілку main. Якщо я просто зроблю фастфорвард (fast-forwarded) в main, тоді в main потраплять всі мої println'и, що є зайвим. Має бути інший шлях...

# Ми маємо сказати гіту скопіювати лише один коміт. Це все те ж саме, що й у попередніх рівнях, і ми можемо використати ті ж самі команди:
# git rebase -i
# git cherry-pick


# Жонглюємо комітами
# Ось інша ситуація, що доволі часто трапляється. В тебе є якісь зміни (newImage) та ще якийсь набір комітів (caption), які зв’язані між собою, тому вони знаходяться один над одним в твоєму репозиторії (або один за одним).
# Штука в тому що іноді потрібно зробити невелику модифікацію до попереднього коміту. В цьому випадку, дизайнери хочуть щоб ми трохи змінили розміри newImage, не зважаючи на те, що цей коміт знаходиться досить глибоко в історії!!

# Ми поборимо цю складність наступним чином:

# Ми відсортуємо коміти таким чином, щоб той, який ми хочемо змінити, був останнім за допомогою git rebase -i
# Ми виконаємо git commit --amend щоб внести невелику правку до останнього коміту
# Тоді ми відсортуємо коміти в попередньому порядку, за допомогою git rebase -i
# І на останок, ми пересунемо main на змінену частину дерева щоб закінчити цей рівень(ти можеш вибрати метод)
# Насправді є кілька способів як виконати поставлену задачу (Я бачу, ти поглядаєш на cherry-pick), і ми розберемося з ними всіма трохи пізніше, але зараз скористаймося саме цим методом. Зверни увагу на фінальний стан в цьому рівні -- позаяк ми перемістили коміти двічі, кожен з них отримає по апострофу. Ще один апостроф додасться коли ми виконаємо commit --amend.
# git branch -f main C3''

# рішення з cherry-pick
# Не забувай, що git cherry-pick вставить коміт з будь-якого місця в HEAD (якщо це не коміт-предок HEAD).


# Таги в Git
# Як ти вже знаєш з попередніх уроків, гілки досить просто переносити в інші місця, і вони постійно вказують на різні коміти в процесі того? як ті в них додаються. Гілки легко модифікувати, часто тимчасово, й вони постійно змінюються.
# В такому разі, де взяти постійне посилання на момент в історії твого проекту? Для таких речей як релізи чи великі мерджі потрібно щось більш стале ніж гілка.

# Є один спосіб! Таги в гіт якраз для цього й були створені -- вони (більш-менш) постійно вказують на певні коміти, й відмічають певні "віхи" в житті проекту, на які ти можеш потім посилатись так само як на гілки.
# Але, що важливіше, вони ніколи не переміщуються під час створення нових комітів. Ти не зможеш "зачекаутити" таг а потім закомітити якісь зміни в цей таг -- таги просто відмічають корисні чи символічні місця в дереві комітів.

# git tag v1 C1  # Ми назвали наш таг v1 і він явно посилається на C1. 
# Якщо пропустити коміт, git просто відмітить те, на чому знаходиться HEAD в данний момент


# Git Describe

# Через те, що таги є такими чудовими "орієнтирами" по коду, git також має команду описати (describe) де ти є відносно найближчого "орієнтира" (тобто тага). І ця команда називається git describe!
# Git describe допоможе тобі знайти себе після того як ти перестрибнеш на кілька комітів по історії вперед чи назад; це може статися після того як ти закінчив git bisect (пошук-дебаггер) чи коли тебе попросили підійти до колеги, котрий щойно прийшов з відпустки.

# Git describe має наступну форму:

# git describe <посилання>

# Де <посилання> -- це будь-що, що вказує на конкретний коміт. Якщо ти не вкажеш посилання, git використає поточну локацію (HEAD).

# Вивід команди виглядає як:

# <таг>_<к-ть комітів>_g<хеш>

# де таг -- це найближчий попередній таг з історії; к-ть комітів -- це наскільки далеко цей таг в історії, а <хеш> -- це хеш коміту, який описується.



# Ребейсимо кілька гілок

# В нас тут до біса гілок! Перенесімо всі зміни з різних гілок в main.
# Але вище керівництво нам не полегшує життя -- вони хочуть, щоб всі коміти були впорядковані. 
# Це означає, що в результаті коміт C7' має бути з самого низу, C6' трохи вище, і так далі, все за порядком.
# Якщо ти щось зробиш не так, сміливо використовуй reset щоб почати спочатку. Подивись на наш розв’язок і подумай, чи ти можеш обійтись меншою кількістю команд!
# git rebase main bugFix # копіює зміни з bugFix на main і переходить HEAD на bugFix
# git rebase bugFix side # копіює зміни з side на bugFix і переходить HEAD на side
# git rebase side another # копіює зміни з another на side і переходить HEAD на another
# git rebase another main # копіює усі зміни з main на another і переходить HEAD на main
# тобто ми заребейсимо усі гілки між собою і у main будуть усі зміни



# Вибираємо Попередників

# Так само як і модифікатор ~, модифікатор ^ також приймає необов’язкове число після нього.

# Замість того, щоб вказувати кількість генерацій щоб переміститись назад (те що робить ~), число після ^ вказує на яке батьківське посилання мерджу потрібно перейти. Зауважте що так як мерджевий коміт має декілька батьків, використання '^' без числа є неоднозначним.

# Git зазвичай перейде на "першого" з батьків вверх з мерджевого коміту, але вказання числа після ^ змінює цю поведінку.

# моє рішення
# git checkout HEAD~^2~1 -b bugWork
# $ git checkout main

# їх рішення
# git branch bugWork main^^2^


# Ми маємо гілку main, яка на кілька комітів попереду гілок one, two та three. З незрозумілих причин, нам потрібно оновити ці гілки більш пізніми змінами з мастеру.

# Гілку one потрібно впорядкувати і видалити C5. Гілку two також потрібно впорядкувати, а в гілку three потрібно додати ще один коміт!

# Ми повністю покладаємось на тебе -- порівняй свій розв’зок з нашим, який можна подивитись командою show solution.

# їх рішення 
# git checkout one
# $ git cherry-pick C4 C3 C2
# $ git checkout two
# $ git cherry-pick C5 C4 C3 C2
# $ git branch -f three C2

# моє рішення:
# git checkout one
# $ git cherry-pick C4 C3 C2
# $ git checkout two
# $ git cherry-pick C5 C4 C3 C2
# $ git checkout three
# $ git cherry-pick C2



# Віддалені репозиторії

# Віддалені репозиторії не є дуже складними. В сучасному світі, де на кожному кроці можна зустріти "хмарні обчислення", може видатися, що концепція віддалених репозиторіїв є дуже складною, але насправді вони -- просто звичайні копії твого репозиторію на віддаленому комп’ютері. Зазвичай з цим віддаленим комп’ютером можна зв’язатися через інтернет, що дозволяє обмінюватись комітами.
# Приймаючи до уваги все сказане вище, віддалені репозиторії мають купу чудових властивостей:
# В першу чергу, віддалені сервери -- це завжди чудова резевна копія (бекап)! Локальний репозиторій дає можливість відкотитися до попереднього стану, але вся інформація зберігається локально. Маючи копії свого репозиторію на віддалених машинах, ти можеш пережити втрату жорсткого диску чи пошкодження данних і продовжити працювати з того місця, на якому закінчив.
# Що не менш важливо, віддалені репозиторії роблять програмування соціальним! Коли копія твого проекту розміщена в мережі, твої друзі мають змогу допомогти твоєму проекту (чи стягнути останні зміни) без зайвих зусиль.
# Стало дуже популярним користуватися веб-сайтами, що візуалізують активність на віддалених репозиторіях (наприклад GitHub), але віддалені репозиторії завжди слугують як основа цих сервісів. Тому важливо розуміти їх!


# Git Fetch

# Робота з віддаленими git-репозиторіями зводиться до передачі данних до та з інших репозиторіїв. Можливість передавати коміти дозволяє нам ділитися будь-якою інформацією, що відслідковується gitом (а отже, виконаною роботою, новими файлами, ідеями, листами, тощо).
# На цьому уроці ми навчимося витягати дані з віддаленого репозиторію -- команда, що відповідає за це, зручно називається git fetch (fetch - англ. витягнути чи дістати).
# Зауваж, що коли ми оновлюємо наш віддалений репозиторій, наші віддалені гілки теж оновляться. Про це ми говорили на попередньому уроці.

# Що робить fetch
# git fetch виконує дві основні дії, і тільки дві дії. Він:
# звантажує коміти, які містить віддалене сховище, але яких немає в локальному сховищі, та...
# оновлює посилання віддаленого бранчу (наприклад, o/main)
# Якщо коротко, git fetch приводить репрезентацію віддаленого репозиторію в локальному сховищі до актуального стану справжнього віддаленого репозиторію.
# Якщо ти пам’ятаєш з попереднього уроку, ми тоді зауважили, що віддалені гілки відображають стан віддаленого репозиторію від останнього разу, коли ми синхронізувались з віддаленим репозиторієм. git fetch якраз і відповідає за синхронізацію з віддаленим сховищем! Сподіваюсь, що зв’язок між віддаленими гілками git fetch тепер є очевидним.
# Як правило, git fetch працює з віддаленими сховищами через інтернет (через протоколи http:// чи git://).

# Чого не робить fetch
# Тим не менш, git fetch нічого не змінює в твоєму локальному стані. Він не оновить твою гілку main і не змінить того, як наразі виглядає локальна файлова система.
# Це важливо зрозуміти, тому що багато розробників думають, що git fetch оновить їхні локальні данні до стану віддаленого репозиторію. Він дійсно звантажить всі потрібні дані, щоб це зробити, але він не змінить автоматично жодних локальних файлів. Ми вивчимо команди, які це роблять, в наступних уроках :D
# Отже, зрештою, ти можеш вважати що git fetch просто звантажує нову інформацію з віддаленого сховища.


# Git Pull

# Тепер, коли ми знаємо як витягувати дані з віддаленого репозиторію за допомогою git fetch, спробуймо оновити нашу робочу копію відповідно до цих данних!
# Насправді, є кілька шляхів як цого досягнути -- щойно нові коміти з’явилися локально, ти можеш додавати їх в бранчі так само, як звичайні коміти. Це означає що ти можеш виконувати команди:

# git cherry-pick o/main
# git rebase o/main
# git merge o/main
# тощо.
# Насправді, процес витягування віддалених змін й подальший мерджинг їх є настільки популярним, що гіт пропонує спеціальну команду, що виконує ці дві дії за один раз! Ця команда називається git pull.


# команди в сервісі тренування роботи з git
# git fakeTeamwork # створює коміт на main
# git fakeTeamwork foo 3 # створює три коміти у гілці foo


# Git Push

# git push використовується для надсилання локальних змін на вказаний віддалений репозиторій; ця команда оновлює віддалений репозиторій, інтегруючи нові коміти. Після виконання git push всі твої друзі зможуть звантажити твої напрацювання з віддаленого сховища.
# Ти можеш вважати, що git push "публікує" твої напрацювання. В цієї команди є кілька особливостей, які ми скоро розглянемо, але почнімо з початку...
# Зауваження: поведінка git push без параметрів різниться в залежності від налаштування git з назвою push.default. Значення за замовчуванням цього налаштування залежить від версії твого git, але в наших уроках ми будемо вважати що воно дорівнює upstream. Це не вкрай важливо, але буде корисно перевірити це налаштування перед тим як пушити свій проект.



# Уяви, що ти склонував репозиторій в понеділок і почав працювати над якоюсь фічею. В пятницю фіча готова і ти хочеш повернути її назад (в апстрім) -- але що це? Твої колеги, грець їм, вже встигли вкомітити купу коду що робить твою фічу застарілою (і не дуже доречною). Вони вже запушили ці коміти в публічний репозиторій, й тепер твоя робота базується на старій версії продукту, що вже не актуальна.
# В цьому випадку команда git push неоднозначна. Коли ти виконаєш git push, гіт повинен змінити віддалений репозиторій до того стану, на якому він знаходився в понеділок? Чи він має додати твій код і залишити код твоїх колег? Чи він має повністю проігнорувати твої зміни, оскільки вони застаріли?
# Через такі неоднозначності в цій ситуації (коли історія розійшлася), git не дозволить тобі запушити твої зміни. Він фактично змушує тебе інтегрувати останні зміни з віддаленого репозиторію перед тим як ти зможеш завантажити на нього свої напрацювання.

# Як вийти з цієї ситуації? Дуже просто! Все, що треба -- це оновити свої напрацювання так, щоб вони базувалися на останніх змінах з віддаленої гілки.
# Є кілька шляхів як цього досягнути, але найпростіший -- це перемістити свою роботу 'вперед' за допомогою rebase. Спробуймо і погляньмо як це виглядає.
# git fetch; git rebase o/main; git push

# Чи є якийсь інший спосіб оновити свої напрацювання, коли віддалений репозиторій пішов вперед? Звісно! Спробуймо зробити те ж саме, але натомість за допомогою merge (злиття).
# Хоча git merge і не переміщує твою роботу (а просто створює натомість коміт злиття чи merge commit), це -- ще один спосіб сказати git, що ти інтегрував останній стан віддаленого репозиторію в свої зміни. Це працює тому, що тепер віддалена гілка є предком твоєї гілки, а отже твої останні коміти інтегрують в собі всі коміти з віддаленої гілки.
# git fetch; git merge o/main; git push

# Чудово! Чи можу я це зробити, використовуючи меншу кількість команд?
# Звісно -- ти ж знаєш, що git pull це просто коротша форма для git fetch а потім git merge. Натомість, git pull --rebase це коротка форма для git fetch а потім git rebase!
# git pull; git push


# Remote Rejected!

# Коли ви працюєте над проектом в складі великої команди розробників, то, швидше за все, гілка main буде заблокована. Для внесення до неї змін в git існує поняття запиту на злиття Pull Request. В такій ситуації, якщо ви закомітите свої зміни безпосередньо в гілку main, а потім виконаєте git push, то буде згенероване повідомлення про помилку:

# ! [remote rejected] main -> main (TF402455: Pushes to this branch are not permitted; you must use a pull request to update this branch.)
# ! [віддалено відхилено] main -> main (TF402455: Зміни (push-запити) цієї гілки заборонені; ви повинні використовувати pull-запит для оновлення цієї гілки.)

# Чому мої зміни були відхилені?
# Віддалений репозиторій відхилив коміти завантажені безпосередньо в гілку main через те, що на main налаштована політика, яка вимагає використання Pull request замість звичайного git push.
# Ця політика має на увазі процес створення нової гілки розробки, внесення до неї всіх потрібних комітів, завантаження змін в віддалений репозиторій і відкриття нового Pull request. Але ви про це забули (чи не знали) і закомітили свої доробки безпосередньо в гілку main. Тепер ви застрягли і не можене запушити свої зміни :(.

# Рішення:
# Створіть ще одну гілку з назвою feature і відправте зміни у віддалений репозиторій. Також не забудьте повернути вашу локальну гілку main в вихідне положення (щоб вона була синхронізована з віддаленою). Інакше у вас можуть виникнути складнощі при наступному виконанні запиту git pull, коли коміти інших розробників конфліктуватимуть з вашими.


# Мердж гілок з фічами

# Тепер, коли ти вже впевнено володієш засобами pull та push, час перевірити ці знання в новому процесі.
# Зазвичай розробники працюють над якимось фічами в окремій гілці (не в main), а потім, коли роботу закінчено, інтегрують її. Це схоже на попередній урок (де окремі гілки пушили у віддалений репозиторій), але тут буде ще один додатковий крок.
# Деякі розробники виконують push і pull лише в гілці main -- тож main завжди буде актуальним і синхронізованим з віддаленою гілкою (o/main).
# Отже для цього процесу ми об'єднуємо дві речі:
# інтеграцію гілки з фічею в main, і
# пул та пуш для синхронізації з віддаленим репозиторієм


# Для того, щоб віддалений сервер прийняв твої зміни, треба об'єднати їх з останніми змінами на сервері. Це означає ребейс або мердж з віддаленою гілкою (напр. o/main).
# Хмм, якщо можна використати один із цих методів, для чого нам додаткові уроки про ребейс? Чому ніхто не любить merge, працюючи з віддаленим сервером?

# В спільноті розробників давно ведуться суперечки щодо переваг і недоліків мерджингу і ребейсу. Ось головні з них для ребейсу:

# За:

# Ребейс дозволяє тримати дерево комітів чистим, оскільки все вибудовується в пряму лінію;
# Проти:

# Ребейс змінює історію в дереві комітів.
# Наприклад, коміт C1 можна ребейснути на C3. Як результат C1' буде йти після C3, хоча насправді його зробили раніше.

# Деякі розробники люблять зберігати історії і тому вибирають мерджинг. Інші (як і я) воліють мати чисте дерево комітів і віддають перевагу ребейсу. Це питання смаку :D



# Гілки віддаленого стеження

# Одна з речей в попередніх уроках, яка могла виглядати, наче "магія" -- це те, що гіт якось знає, що локальна гілка main відповідає віддаленій o/main. Звичайно, ці гілки мають схожі назви, і виглядає логічним співставити віддалену гілку main з локальною main, однак цей зв'язок найкраще видно в двох випадках:

# Під час операції pull, коміти попадають в o/main, а вже потім мерджаться в локальний main. Гілка в яку відбудеться мердж якраз і визначається цим зв'язком.
# Під час операції push, коміти з гілки main переносяться у віддалений main (який локально представлений як o/main). Гілка-призначення для push визначена зв'язком між main і o/main.


# Гілки віддаленого стеження

# В двох словах, цей зв'язок між main та o/main і є тим "віддаленим стеженням", визначеним для гілки. Гілка main налаштована стежити за o/main -- це визначає неявну ціль для мерджу і неявне призначення під час операції push для гілки main.
# Ви можете подумати, а як же такий зв'язок було встановлено, якщо я не виконував жодної команди? Ну, коли гіт клонує репозиторій, він встановлює цей зв'язок автоматично.
# Під час клонування гіт створює гілки для стеження за кожною гілкою віддаленого репозиторію (напр. o/main). Потім він створює локальну гілку, що пов'язана і стежить за активною гілкою у віддаленому репозиторії, яка в більшості випадків називається main.
# Після закінчення клонування у вас буде лише одна локальна гілка (щоб не перевантажувати) але ви можете переглянути всі віддалені гілки (якщо буде цікаво). Такий собі розумний компроміс!
# Це пояснює чому ви бачите наступне повідомлення під час клонування:
# local branch "main" set to track remote branch "o/main"


# А можу я сам вибирати?

# Так, можеш! Ти можеш вибрати довільну гілку, яка слідкуватиме за o/main, і тоді для цієї гілки push та merge автоматично працюватимуть з main. Це означає, що виконання git push в гілці з назвою totallyNotMain (зовсім не main) може зберегти локальні коміти у віддалену гілку main!
# Є два шляхи встановити такий зв'язок. Перший - створити нову гілку з явним вказанням зв'язку (за ким слідкувати). Виконання
# git checkout -b totallyNotMain o/main
# створить гілку totallyNotMain, яка слідкує за o/main.

# Спосіб №2

# Інший спосіб вказати за якою віддаленою гілкою слідкувати -- просто використовувати опцію git branch -u. Виконання
# git branch -u o/main foo
# змусить гілку foo слідкувати за o/main. Якщо foo є поточною гілкою, її можна навіть не вказувати:
# git branch -u o/main


# Аргумeнти git push

# Чудово! А зараз, коли ти знаєш все про відслідковування віддалених гілок, ми можемо розглянути "магію", що відбувається при git push, fetch, і pull. Ми розглянемо лише окремі команди для розуміння загального принципу.
# Спочатку розгляньмо git push. З уроку про відслідковування віддалених гілок ми знаємо, що git визначає куди і в яку гілку робити push, дивлячись на локальну поточну гілку (і віддалену, за якою вона "слідкує"). Це поведінка push без аргументів, але git push може приймати необов'язкові аргументи в форматі:
# git push <remote> <place>

# Ви спитаєте, що таке аргумент <place>? Ми скоро вдамося в детальні пояснення, але спочатку -- приклад. Виконання команди:

# git push origin main
# буквально перекладається як:

# Піди в гілку, що називається "main" в моєму репозиторії, візьми всі коміти, піди у віддалений "main", що називається "origin". Додай ті коміти, яких немає в цій гілці і надрукуй, що саме ти зробив.
# Вказуючи main в якості аргумента "place", ми сказали git-у, звідки взяти коміти і куди їх додати. ("Place") - фактично точка синхронізації двох репозиторіїв.
# Пам'ятайте, що оскільки ми надали git-у всю необхідну інформацію (вказавши обидва аргументи), не має значення яка гілка є зараз поточною!


# Детальніше про аргумент <place>

# З попереднього уроку нам відомо, що коли ми вказуємо main в якості аргумента place для git push, ми задаємо і гілку, з якої брати нові коміти, і гілку до якої їх буде перенесено.
# Тут ти можеш задуматись, а чи можуть гілки, звідки беремо, і куди переносимо, бути різними? Що, коли потрібно коміти з локальної гілки foo перенести у віддалену гілку bar?
# Нажаль в git це неможливо... жартую! Звісно, що можливо :)... git просто неймовірно гнучкий (іноді аж занадто).

# Для того, щоб в одному аргументі <place> вказати і місце звідки і куди, треба їх просто розділити двокрапкою:
# git push origin <source>:<destination>
# Такий запис називають "colon refspec". Тут refspec - це просто зручна назва місця, яке git може ідентифікувати (наприклад, гілка foo чи просто HEAD~1)
# Можливість вказати два різних місця дає велику свободу і гнучкість в роботі з віддаленим репозиторієм. Подивімось демонстрацію!

# Пам'ятай, source -- це будь-яка назва місця, зрозуміла гіту:
# git push origin foo^:main
# це доволі незвична команда, але тут все має сенс -- git, знаючи куди вказує foo^, завантажив на віддалену сторону ще відсутні там коміти і оновив місце призначення.

# А що, коли вказаного місця призначення не існує? Нема проблем! Просто вкажи назву гілки і гіт створить її на віддаленому сервері.
# git push origin main:newBranch


# Аргументи git fetch
# Отже, ми вже вивчили все про аргументи git push, про корисний параметр <place> і про формат запису з двокрапкою (<source>:<destination>). Чи знадобляться нам ці зання при вивченні git fetch?
# Ще б пак! Аргументи для git fetch насправді дуже, дуже схожі на git push. Принцип той самий, з точністю до напрямку (бо ми звантважуємо коміти, а не завантажуємо).

# Параметр <place>

# Якщо вказати параметр <place> для команди git fetch, наприклад, так:
# git fetch origin foo
# git піде у віддалену гілку foo, візьме всі коміти, яких немає локально і закине в локальну гілку o/foo.
# Подивімось на це в дії (просто щоб пригадати).

# Ти можеш спитати, чому git закинув ці коміти в гілку o/foo замість того, щоб покласти їх відразу в локальну гілку foo? Я думав, що параметр <place> одночасно вказує місце звідки взяти і куди поставити?
# Ну, git робить невеликий виняток в цьому випадку, оскільки ти, ймовірно, маєш якусь роботу в foo, і не хочеш там нічого зіпсувати! Пригадай з попереднього уроку про git fetch -- він не оновлює твої локальні (не віддалені -- без o/) гілки, він тільки звантажує коміти (так, щоб їх можна було переглянути/змерджити пізніше).

# "Ну, в такому разі, що буде, якщо явно вказати і джерело і призначення <source>:<destination>?"
# Якщо ти почуваєшся достатньо впевненим і хочеш звантажити віддалені коміти прямо в свою локальну гілку, тоді -- справді, ти можеш так написати, використавши синтаксис з двокрапкою. Єдиний виняток -- таким способом не можна витягувати зміни в поточну локальну гілку, в будь-яку іншу -- без проблем.
# Тепер в нас <source> вказує на віддалений репозиторій, а <destination> -- на локальне місце, куди звантажаться коміти. Це повна протилежність тому, як було в git push, що, зрештою, має сенс, адже ми передаємо дані у протилежному напрямку!
# Насправді, розробники рідко використовують такий спосіб на практиці. І він показаний тут лише для повноти описання наскільки fetch і push схожі, відрізняючись лише напрямом дії.

# git fetch origin c3:foo
# $ git fetch origin c6:main
# $ git checkout foo
# $ git merge main


# Неочевидні способи використання <source>

# Git має два хитрі способи використання <source>. Обидва випливають з факту, що формально (і цілком легально) ти можеш не вказувати джерело (source) як для git push так і для git fetch. Ось, як саме ти можеш це зробити:
# git push origin :side
# git fetch origin :bugFix

# Що буде, якщо спробувати запушити "ніщо" у гілку віддаленого репозиторію? Git її видалить!
# git push origin :foo

# І останнє, звантаження "нічого" в локальний репозиторій створює нову гілку
# git fetch origin :foo


# Аргументи git pull

# Зараз, коли ти знаєш майже все, що можна знати про аргументи для git fetch і git push, дійсно майже нема чого розповідати про git pull :)
# Це тому, що git pull, зрештою, просто зручне об'єднання fetch і merge. Його можна собі уявляти як git fetch і git merge виконані з однаковими аргументами.
# Це працює незалежно від складності переданих аргументів. Розгляньмо:

# Ось декілька еквівалентних команд git:

# git pull origin foo це те саме, що й:

# git fetch origin foo; git merge o/foo

# А...

# git pull origin bar:bugFix -- це аналог:

# git fetch origin bar:bugFix; git merge bugFix

# Бачиш? git pull -- це просто зручне скорочення для fetch + merge. А все, про що дбає git pull -- це те, куди в результаті підуть коміти (а про це йому говорить аргумент destination).

# git pull origin main:foo
# Ми створили локальну гілку з назвою foo, звантажили в неї коміти з віддаленого main, а потім змерджили foo в поточну гілку bar!
# git pull origin c3:foo
# $ git pull origin c2:side